# Richie Rich

In [1]:
import pandas as pd

data = {
    'name': ['Elon', 'Jeff', 'Bill', 'Falguni'],
    'gender': ['M', 'F', 'M', 'F'],
    'income': [53000, 28000, 25000, 44000]
}

df = pd.DataFrame(data)

In [2]:
df

      name gender  income
0     Elon      M   53000
1     Jeff      F   28000
2     Bill      M   25000
3  Falguni      F   44000

In [5]:
max = df[df.income == df.income.max()]
max

   name gender  income
0  Elon      M   53000

In [7]:
max['name'].values[0]

'Elon'

In [9]:
max.name.values[0]

'Elon'